finalSolverData/water/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default backward;
    ddt(rho,U) backward;
    ddt(U) backward;
}

gradSchemes
{
    default Gauss linear;
}

divSchemes
{
    default none;
    div(phi,U)          Gauss GammaVDC 0.5;
    div(phi,taufirst)   Gauss upwind;                               // added 23.07.19
    div(phi,tausecond)  Gauss upwind;                               // added 23.07.19
    div(phi,tauthird)   Gauss upwind;                               // added 23.07.19
    div(tau)            Gauss linear;                               // added 23.07.19
}

laplacianSchemes
{
    default none;
    laplacian(etaPEff,U)        Gauss linear corrected;             // added 23.07.19
    laplacian(etaPEff+etaS,U)   Gauss linear corrected;             // added 23.07.19
    laplacian(muFluidB,U)       Gauss linear corrected;
    laplacian((1|A(U)),p)       Gauss linear corrected;
}

interpolationSchemes
{
    default linear;
}

snGradSchemes
{
    default corrected;
}


// ************************************************************************* //
