finalSolverData/water/system/faSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default backward;
}

gradSchemes
{
    default none;
    grad(Us) Gauss linear;
    grad((Us&faceAreaNormals)) Gauss linear;
}

divSchemes
{
    default none;
    div(Us)         Gauss linear;
    div(phis,tauSurfacefirst)   Gauss upwind;                               // added 
    div(phis,tauSurfacesecond)   Gauss upwind;                               // added 
    div(phis,tauSurfacethird)   Gauss upwind;                               // added 
}


laplacianSchemes
{
    default             none;
}

interpolationSchemes
{
    default none;
}

snGradSchemes
{
    default none;
}


// ************************************************************************* //
